Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memr.tmx
Source language: ca
Languages: es

source: { Nos ofreció un postre típico buenísimo} $$ { *Ens va oferir unes postres típiques boníssim}: funciona incorrectament perquè no reconeix la seqüència completa { art}--{ subst}--{ adj}--{ adj}; en canvi, sí reconeix la seqüència més curta (2) { art}--{ subst}--{ adj} i propaga el gènere del substantiu només a l'article i al primer adjectiu.
es: { Nos ofreció un postre típico buenísimo} $$ { Nos ofreció unos postres típicos buenísimo}: funciona incorrectamente porque no reconoce la secuencia completa { arte}--{ subst}--{ adj}--{ adj}; en cambio, sí reconoce la secuencia más corta (2) { arte}--{ subst}--{ adj} y propaga el género del sustantivo sólo al artículo y al primer adjetivo.

source: Després de veure angoixave- encara no sabem la persona del verb (pot ser la segona del singular o la tercera del plural).
es: Después de ver angoixave- todavía no sabemos la persona del verbo (puede ser la segunda del singular o la tercera del plural).

source: Finalment s'apliquen ajustos locals que afecten l'ordre dels mots en la frase (reordenaments locals) i es flexionen les paraules en la LM.
es: Finalmente se aplican ajustes locales que afectan al orden de las palabras en la frase (reordenamientos locales) y se flexionan las palabras en la LM.

source: problemes amb l'ordre dels mots: Jo he estat sempre un professional responsable $$ *I have been always a professional responsible en comptes de I have always been a responsible professional
es: problemas con la orden de las palabras: Yo he sido siempre un profesional responsable $$ Y have been always a profesional responsible en vez de I have always been a responsible profesional

source: { Nos ofreció un postre muy bueno} $$ { *Ens va oferir unes postres molt bo}: funciona incorrectament perquè no reconeix la seqüència completa { art}--{ subst}--{ adv}--{ adj}; en canvi, sí reconeix la seqüència més curta (1) { art}--{ subst} i propaga el gènere del substantiu només a l'article.
es: { Nos ofreció un postre muy bueno} $$ { Nos ofreció unos postres muy bueno}: funciona incorrectamente porque no reconoce la secuencia completa { arte}--{ subst}--{ adv}--{ adj}; en cambio, sí reconoce la secuencia más corta (1) { arte}--{ subst} y propaga el género del sustantivo sólo al artículo.

source: glt La casa gran de l'amor.
es: glt La casa grande del amor.

source: Finalment, quan veiem angoixaven ja sabem que és la tercera del plural.
es: Finalmente, cuando vemos angoixaven ya sabemos que es la tercera del plural.

source: Altre exemple el tenim en la frase ``li diuen Joan'': He is called Joan.
es: Otro ejemplo lo tenemos en la frase ``le llaman Joan'': He is called Joan.

source: {10cm}{ TRANSFERÈNCIA} {{10cm}{ {{9cm}{ REGLES DE REORDENAMENT I CONCORDANÇA:
es: {10cm}{ TRANSFERÉNCIA} {{10cm}{ {{9cm}{ REGLAS DE REORDENAMIENTO Y CONCORDANCIA:

source: Com en el cas dels traductors professionals, els sistemes de traducció automàtica no sempre necessiten comprendre les frases en LO (és a dir, construir-ne una interpretació explícita).
es: Como en el caso de los traductores profesionales, los sistemas de traducción automática no siempre necesitan comprender las frases en LO (es decir, construir una interpretación explícita).

source: Quan les llengües involucrades són sintàcticament similars (per exemple, quan estan emparentades), no es fa l'anàlisi sintàctica completa: la transferència lèxica és completa però la transferència estructural és parcial i local i només es fa on és necessària.
es: Cuando las lenguas involucradas son sintácticamente similares (por ejemplo, cuando están emparentadas), no se hace el análisis sintáctico completo: la transferencia léxica es completa pero la transferencia estructural es parcial y local y sólo se hace donde es necesaria.

source: En canvi, les estructures que serveixen per a expressar altres conceptes poden ser completament paral·leles.
es: En cambio, las estructuras que sirven para expresar otros conceptos pueden ser completamente paralelas.

source: A dark autumn high tide (Una marea alta de tardor fosca)
es: A dark autumn high tide(Una marea alta de otoño oscuro)

source: A dark autumn night (Una nit fosca de tardor)
es: A dark autumn night (Una noche oscura de otoño)

source: A dark magic silhouette (Una silueta màgica fosca)
es: A dark magic silhouette(Una silueta mágica oscuridad)

source: A dark night (Una nit fosca)
es: A dark night(Una noche oscura)

source: A magic dark silhouette (Una silueta fosca màgica)
es: A magic dark silhouette(Una silueta oscura mágica)

source: A més, els dos passos tenen interpretacions senzilles: el primer pas uneix terminacions comunes (troba regularitats en la transducció dels sufixos) i el segon uneix començaments comuns (troba regularitats en la transducció dels prefixos).
es: Además, los dos pasos tienen interpretaciones sencillas: el primer paso une terminaciones comunes (encuentra regularidades en la transducción de los sufijos) y el segundo une comienzos comunes (encuentra regularidades en la transducción de los prefijos).

source: A més, es requereix que es puguen afegir fàcilment altres llengües com l'occità, el sard o l'asturià.
es: Además, se requiere que se puedan añadir fácilmente otras lenguas como el occitano, el sard o el asturiano.

source: A pesar d'això, la traducció mot per mot no és practicable perquè el gènere i el nombre gramatical d'alguns substantius varia i els adjectius, articles, etc., que l'acompanyen no concordarien correctament: cast. { una señal muy clara} $$ cat.
es: A pesar de esto, la traducción palabra por palabra no es practicable porque el género y el número gramatical de algunos sustantivos varía y los adjetivos, artículos, etc. que lo acompañan no concordarían correctamente: cast. { una señal muy clara} $$ cat.

source: A pesar que tant el primer mot com el segon mot de cada parell tenen freqüències similars, en algun cas les freqüències d'aparició conjunta són molt elevades i en uns altres casos són molt més reduïdes.
es: A pesar de que tanto la primera palabra como la segunda palabra de cada par tienen frecuencias similares, en algún caso las frecuencias de aparición conjunta son muy elevadas y en otros casos son mucho más reducidas.

source: Acció
es: Acción

source: Així només es visita una vegada cada mot de la frase.
es: Así sólo se visita una vez cada palabra de la frase.

source: Això fa que les dades lingüístiques que usen els mòduls d'anàlisi es puguen usar per a construir mòduls de generació i viceversa.
es: Eso hace que los datos lingüísticos que usan los módulos de análisis se puedan usar para construir módulos de generación y viceversa.

source: Això fa que, actualment, només s'hagen desenvolupat sistemes d'interlingua clàssics per a àmbits temàtics molt concrets.
es: Esto hace que, actualmente, sólo se hayan desarrollado sistemas de interlingua clásicos para ámbitos temáticos muy concretos.

source: Això només és viable si n'hi ha poques excepcions d'aquesta mena, com sembla que és el cas.
es: Esto sólo es viable si hay pocas excepciones de este tipo, como parece que es el caso.

source: Això suggereix la necessitat d'una nova regla que detecte i reordene el patró llarg adjectiu--substantiu--substantiu--substantiu, per exemple: [$R_3$] adj subst$_1$ subst$_2$ subst$_3$ $$ subst$_3$ adj prepde { subst}$_2$ prepde subst$_1$ Aquesta regla podria reordenar correctament aquesta seqüència de quatre mots.
es: Eso sugiere la necesidad de una nueva regla que detecte y reordene el patrón largo adjetivo--sustantivo--sustantivo--sustantivo, por ejemplo: [$R_3$] adj sust$_1$ sust$_2$ sust$_3$ $$ sust$_3$ adj prepde { sust}$_2$ prepde sust$_1$ Esta regla podría reordenar correctamente esta secuencia de cuatro palabras.

source: Algunes traduccions són errònies perquè el sistema no té un catàleg massa complet de regles.
es: Algunas traducciones son erróneas porque el sistema no tiene un catálogo demasiado completo de reglas.

source: Alternativament, es pot aprofundir en l'anàlisi i baixar a un nivell semàntic de l'estil del representat més amunt, i generar en cada cas la traducció a partir d'aquesta representació semàntica, que ja no depén tant de la llengua concreta.
es: Alternativamente, se puede profundizar en el análisis y bajar a un nivel semántico del estilo del representado más arriba, y generar en cada caso la traducción a partir de esta representación semántica, que ya no depende tanto de la lengua concreta.

source: Altres vegades es dóna el problema de l'ambigüitat lèxica categorial (vegeu l'apartat ): és a dir, el mot pot pertànyer a dues categories lèxiques diferents i cal usar informació sobre les categories morfològiques dels mots anteriors i posteriors (en absència d'informació sintàctica) per a desfer l'ambigüitat.
es: Otras veces se da el problema de la ambigüedad léxica categorial (mirad el apartado): es decir, la palabra puede pertenecer a dos categorías léxicas diferentes y es necesario usar información sobre las categorías morfológicas de las palabras anteriores y posteriores (en ausencia de información sintáctica) para deshacer la ambigüedad.

source: An autumn tide (Una marea de tardor)
es: An autumn tide (Una marea de otoño)

source: Aquest algorisme és particularment eficient en el cas dels transductors de lletres acíclics.
es: Este algoritmo es particularmente eficiente en el caso de los transductores de letras acíclicos

source: Aquest capítol descriu les tècniques o, dit d'una altra manera, les estratègies bàsiques usades pels programes de traducció automàtica també proposa una classificació general dels sistemes de traducció automàtica basada, entre altres criteris, en l'arquitectura (estratègia).}, seguint aquest esquema:
es: Este capítulo describe las técnicas o, dicho de otro modo, las estrategias básicas usadas por los programas de traducción automática también propone una clasificación general de los sistemas de traducción automática basada, entre otros criterios, en laarquitectura (estrategia).}, siguiendo este esquema:

source: Aquesta aproximació pot no funcionar perquè de vegades les transformacions dels arbres depenen de la interpretació de mots concrets i de parts de l'oració.
es: Esta aproximación puede no funcionar porque a veces las transformaciones de los árboles dependen de la interpretación de palabras concretas y de partes de la oración.

source: Aquesta aproximació pot ser particularmentt útil quan les llengües entre les quals ha de traduir el sistema tenen una gran similitud sintàctica i semàntica, com en el cas de les llengües romàniques, amb l'excepció, potser, del romanés.
es: Esta aproximación puede ser particularmente útil cuando las lenguas entre las cuales tiene que traducir el sistema tienen una gran similitud sintáctica y semántica, como en el caso de las lenguas románicas, con la excepción, quizás, del rumano.

source: Aquesta aproximació és l'aproximació de la transferència parcial.
es: Esta aproximación es la aproximación de la transferencia parcial.

source: Aquesta és una aproximació addicional, l'aproximació de transferència.
es: Esta es una aproximación adicional, la aproximación de transferencia.

source: Aquestes aproximacions inductives també reben el nom de traducció automàtica basada en corpus.
es: Estas aproximaciones inductivas también reciben el nombre de traducción automática basada en corpus.

source: Aquestes operacions es poden resoldre de manera molt natural en un sistema de transferència sintàctica.
es: Estas operaciones se pueden resolver de manera muy natural en un sistema de transferencia sintáctica.

source: Ara, pensem què li succeiria a ``tall truck driver''.
es: Ahora, pensemos qué le sucedería a ``tall truck driver''.

source: Assenyaleu quina seria la traducció del sistema per a totes les oracions anteriors usant el conjunt de regles que heu proposat.
es: Señalad qué sería la traducción del sistema para todas las oraciones anteriores usando el conjunto de reglas que habéis propuesto.

source: CasCat és un sistema de traducció automàtica de l'espanyol al català que usa regles que reordenen seqüències de categories morfològiques.
es: CasCat es un sistema de traducción automática del español al catalán que usa reglas que reordenan secuencias de categorías morfológicas.

source: Com a exemple, descriurem un tipus bastant estés d'analitzador ascendent, anomenat usualment GLR (generalized LR o LR generalitzat, on LR és l'abreviació de left-to-right, rightmost derivation, ``d'esquerra a dreta i amb derivació per la dreta'').
es: Como ejemplo, describiremos un tipo bastante extendido de analizador ascendente, denominado usualmente GLR (generalized LR o LR generalizado, donde LR es la abreviación de left-to-right, rightmost derivation, "de izquierda a derecha y con derivación por la derecha'').

source: Com a màxim, podem dir que el lema comença per { ang}.
es: Como máximo, podemos decir que el lema comienza por { ang}.

source: Com en els exemples, en maori la majoria dels noms i adjectius són invariables.
es: Como en los ejemplos, en maori la mayoría de los nombres y adjetivos son invariables.

source: Com era el sistema abans de l'addició de la nova llengua?
es: ¿Cómo era el sistema antes de la adición de la nueva lengua?

source: Com es podrien evitar els problemes observats?
es: ¿Cómo se podrían evitar los problemas observados?

source: Com es pot veure, les regles de reordenament intenten descobrir unitats sintàctiques (sintagmes) usant un nombre limitat de patrons que representen les seqüències de mots que poden formar aquestes unitats; el problema és que els sintagmes poden ser, en principi, indefinidament llargs, i el conjunt de regles de reordenament ha de ser forçosament limitat.
es: Como se puede ver, las reglas de reordenamiento intentan descubrir unidades sintácticas (sintagmas) usando un número limitado de patrones que representan las secuencias de palabras que pueden formar estas unidades; el problema es que los sintagmas pueden ser, en principio, indefinidamente largos, y el conjunto de reglas de reordenamiento tiene que ser forzosamente limitado.

source: Com es veurà, molt freqüentment es qualifiquen de directes estratègies que sí que generen representacions intermèdies molt rudimentàries, i que, per tant, en sentit estricte, haurien de ser classificades com a indirectes.
es: Como veremos, muy frecuentemente se califican de directas estrategias que sí que generan representaciones intermedias muy rudimentarias, y que, por lo tanto, en sentido estricto, tendrían que ser clasificadas como indirectas.

source: Com podria fer l'elecció adequada un sistema de traducció automàtica?
es: ¿Como podría hacer la elección adecuada un sistema de traducción automática?

source: Com que els sistemes de transferència morfològica no identifiquen les relacions sintàctiques entre els mots de la frase en la llengua d'origen, per a fer els reordenaments han d'identificar les seqüències de mots que necessiten ser reordenats.
es: Como los sistemas de transferencia morfológica no identifican las relaciones sintácticas entre las palabras de la frase en la lengua de origen, para hacer los reordenamientos tienen que identificar las secuencias de palabras que necesiten ser reordenadas.

source: Com que l'objectiu de l'equip que dissenya els diccionaris és que tinguen la cobertura més alta possible (és a dir, que deixen el mínim possible de mots sense traduir), la única estratègia raonable és la d'ordenar els mots de la llengua original per freqüències d'aparició i anar introduint-los en el diccionari en aquest ordre, de manera que en cada moment sempre estem augmentant la cobertura del diccionari tan ràpidament com és possible.
es: Como que el objetivo del equipo que diseña los diccionarios es que tengan la cobertura más alta posible (es decir, que dejan el mínimo posible de palabras sin traducir), la única estrategia razonable es la de ordenar las palabras de la lengua original por frecuencias de aparición e ir introduciéndolos en el diccionario en este orden, de forma que en cada momento siempre estamos aumentando la cobertura del diccionario tan rápidamente cómo es posible.

source: Com que una vegada identificada la classe de sintagma queda clar que el nucli és el primer element (el substantiu), ja es pot propagar el gènere i el nombre del primer element al segon (l'adjectiu).
es: Como una vez identificada la clase de sintagma queda claro que el núcleo es el primer elemento (el sustantivo), ya se puede propagar el género y el número del primer elemento al segundo (el adjetivo).

source: D'acord amb aquesta definició, les etiquetes de transició poden ser de quatre classes: $(:)$, que indica que es llig el símbol $$ i s'escriu el símbol $$; $(:)$, que indica que es llig un símbol però no s'escriu res; $(:)$, que indica que no es llig res però s'escriu un símbol, i $(:)$, que indica que la transició d'estat succeeix sense llegir ni escriure.
es: De acuerdo con esta definición, las etiquetas de transición pueden ser de cuatro clases: $(:)$, que indica que se lee el símbolo $$ y se escribe el símbolo $$; $(:)$, que indica que se lee un símbolo pero no se escribe nada; $(:)$, que indica que no se lee nada pero se escribe un símbolo, y $(:)$, que indica que la transición de estado sucede sin leer ni escribir.

source: D'altra banda, pot haver-hi més d'una transducció vàlida per a una cadena d'entrada $w$.
es: Por otro lado, puede haber más de una transducción válida para una cadena de entrada $w$.

source: D'interlingua amb 4 llengües (hem afegit la quinta).
es: De interlingua con 4 lenguas (hemos añadido la quinta).

source: De fet, com ja s'ha dit, els sintagmes tenen estructura; és a dir, les relacions entre els elements d'un sintagma no són purament lineals, sinó jeràrquiques: els sintagmes estan fets de sintagmes.
es: De hecho, como ya se ha dicho, los sintagmas tienen estructura; es decir, las relaciones entre los elementos de un sintagma no son puramente lineales, sino jerárquicas: los sintagmas están hechos de sintagmas.

source: De fet, si ordenem els mots d'un gran corpus de text real (de qualsevol tipus i de qualsevol idioma) pel nombre de vegades que hi apareixen, començant pel més freqüent, el nombre d'aparicions es redueix dramàticament segons que anem baixant per la llista.
es: De hecho, si ordenamos las palabras de un gran corpus de texto real (de cualquier tipo y de cualquier idioma) por el número a veces que aparecen, empezando por el más frecuente, el número de apariciones se reduce dramáticamente según vamos bajando por la lista.

source: De fet, és típic que la majoria dels mots siguen hapax legomena, és a dir, mots que han aparegut només una vegada en tot el corpus.
es: De hecho, es típico que la mayoría de las palabras sean hapax legomena, es decir, palabras que han aparecido sólo una vez en todo el corpus.

source: De vegades l'anàlisi morfològica pot ser més difícil del que sembla, com per exemple, en el cas de la morfologia verbal de les llengües romàniques.
es: A veces el análisis morfológico puede ser más difícil de lo que parece, como por ejemplo, en el caso de la morfología verbal de las lenguas románicas.

source: Deixeu de banda la concordança i centreu-vos només en els reordenaments.
es: Dejad de lado la concordancia y centraos sólo en los reordenamientos.

source: Després, el sistema continua traduint mot per mot.
es: Después, el sistema continúa traduciendo palabra por palabra.

source: Després, per als idiomes elegits, doneu un exemple de traducció mot a mot inacceptable en tres d'aquests cinc casos: homografia mal resolta d'un mot polisèmia mal resolta d'un mot problemes de concordança ambigüitat estructural mal resolta problemes amb l'ordre dels mots
es: Después, para los idiomas elegidos, dais un ejemplo de traducción palabra a palabra inaceptable en tres de estos cinco casos: homografía mal resuelta de una palabra polisemia mal resuelta de una palabra problemas de concordancia ambigüedad estructural mal resuelta problemas con el orden de las palabras.

source: Dos, un per a la fase d'anàlisi i un altre per a la de generació.
es: Dos, uno para la fase de análisis y otro para la de generación.

source: Dues regles són suficients (la resta va bé mot per mot):
es: Dos reglas son suficientes (el resto va bien palabra por palabra):

source: Dues traduccions possibles del mot català cap a l'espanyol són cabe o cabeza.
es: Dos traducciones posibles de la palabra catalana hacia el español son cabe o cabeza .

source: El principi de composicionalitat postula que la interpretació d'una oració es construeix combinant les interpretacions dels mots seguint precisament les agrupacions successives (constituents) que indica l'arbre d'anàlisi sintàctica de l'oració, partint dels mots i anant cap a l'arrel de l'arbre.
es: El principio de composicionalidad postula que la interpretación de una oración se construye combinando las interpretaciones de las palabras siguiendo precisamente las agrupaciones sucesivas (constituyentes) que indica el árbol de análisis sintáctico de la oración, partiendo de las palabras y yendo hacia la raíz del árbol.

source: El GDA d'un analitzador morfològic té un vèrtex inicial únic (del qual només poden eixir fletxes) que representa l'estat inicial de l'analitzador abans de començar a llegir un mot.
es: El GDA de un analizador morfológico tiene un vértice inicial único (del cual sólo pueden salir flechas) que representa el estado inicial del analizador antes de empezar a leer una palabra.

source: El cas de l'alemany és encara més complicat perquè l'acció de donar plaer es representa com a adverbi.
es: El caso del alemán es todavía más complicado porque la acción de dar placer se representa como adverbio.

source: El conjunt d'etiquetes de transició és $L=( ) ( )$ on $$ és l'alfabet dels símbols d'entrada, $$ l'alfabet dels símbols d'eixida i $$ representa el símbol buit.
es: El conjunto de etiquetas de transición es $L=( ) ( )$ donde $$ es el alfabeto de los símbolos de entrada, $$ el alfabeto de los símbolos de salida y $$ representa el símbolo vacío.

source: El graf és { acíclic} si, seguint les fletxes, no es pot passar dues voltes pel mateix vèrtex.
es: El grafo es { acíclico} si, siguiendo las flechas, no se puede pasar dos veces por el mismo vértice.

source: El llatí clàssic no, perquè a pesar de ser l'origen de totes les llengües del sistema té una sintaxi ---verb final--- i morfologia --declinació--- molt diferents; la llengua artificial anomenada interlingua ---``le lingua international facile e de aspecto natural elaborate per linguistas professional como denominator commun del linguas le plus diffundite in le mundo''.}--- amb anotacions sintàctiques i marques de desambiguació podria ser una millor opció.
es: El latín clásico no, porque a pesar de ser el origen de todas las lenguas del sistema tiene una sintaxis ---verbo final--- y morfología --declinación--- muy diferentes; la lengua artificial llamada interlingua ---``le lingua international facile e de aspecto natural elaborate por linguistas profesional como denominator commun del linguas le plus diffundite in le mundo''.}--- con anotaciones sintácticas y marcas de desambiguación podría ser una mejor opción.

source: El problema és que moltes vegades les funcions que assigna l'estructura sintàctica no es corresponen de la mateixa manera en totes les llengües amb els rols o els actors semàntics de l'acció.
es: El problema es que muchas veces las funciones que asigna la estructura sintáctica no se corresponden del mismo modo en todas las lenguas con los roles o los actores semánticos de la acción.
